9zigen/STM32L1/Using Standard Peripheral Drivers/STEPPER/stm32l1xx_stepper.c
void timer3_init()
{
	TIM_TimeBaseInitTypeDef timer3;
	RCC_ClocksTypeDef system_freq;
	NVIC_InitTypeDef timer3_int;
	uint32_t timer_freq;
	uint32_t timer_prescaler;
	uint32_t timer_periode;
		
	RCC_GetClocksFreq(&system_freq);	//get system clocks
	timer_freq = system_freq.PCLK1_Frequency;	//TIM3 clock 
	timer_prescaler = TIM3_INCREMENT_RESOLUTION * (timer_freq / 1000000);	// example: Prescaler = 250[us] * 32[MHz] = 8000; 
	timer_periode = (1000000 / DEFAULT_PPS) / TIM3_INCREMENT_RESOLUTION;	// default pulses per second
	// 1000000/pulses_per_second
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);	//check smt32l1xx_rcc.c
	timer3.TIM_Prescaler = timer_prescaler;
	timer3.TIM_CounterMode = TIM_CounterMode_Up;
	timer3.TIM_Period = timer_periode -1;						
	timer3.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInit(TIM3, &timer3);
	
	timer3_int.NVIC_IRQChannel = TIM3_IRQn;
	timer3_int.NVIC_IRQChannelPreemptionPriority = 10;
	timer3_int.NVIC_IRQChannelSubPriority = 0;
	timer3_int.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&timer3_int);

	TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
	TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);	//check smt32l1xx_tim.c
	TIM_Cmd(TIM3, DISABLE);
	TIM3_update_flag = 0;
}	

void TIM3_IRQHandler()
{
	if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
  {
		TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
		TIM3_update_flag = 1;
		
	}
}

/*
Sets the speed in pulsesPerSecond: 1<1000
*/
void setSpeed(stepper_struct* current_stepper, uint32_t pulsesPerSecond)
{
  uint32_t period = (1000000 / pulsesPerSecond) / TIM3_INCREMENT_RESOLUTION;
	current_stepper->stepper_speed = period - 1;
	//TIM_SetAutoreload(TIM3, period-1);
}

/*
  * Moves the motor steps_to_move steps.  If the number is negative, the motor moves in the reverse direction.
	* blocking function - doesn't allow target change.
 */
void step(stepper_struct* current_stepper, int steps_to_move)
{  
  int steps_left = abs(steps_to_move);  // how many steps to take
	 
  // determine direction based on whether steps_to_move is + or -:
  if (steps_to_move > 0) {current_stepper->direction = DIRECTION_CW;}
  if (steps_to_move < 0) {current_stepper->direction = DIRECTION_CCW;}

  // decrement the number of steps, moving one step each time:
  while(steps_left > 0) {			

		// increment or decrement the step number, depending on direction:
		if( current_stepper->direction == DIRECTION_CW) {
			current_stepper->current_step_number++;	// increment overall step number - from home position
			current_stepper->step_number++;
			if( (current_stepper->step_number) == current_stepper->number_of_steps) {
				current_stepper->step_number = 0;
			}
		} 
		else { 
			current_stepper->current_step_number--;	// decrement overall step number - from home position
			if (current_stepper->step_number == 0) {
				current_stepper->step_number = current_stepper->number_of_steps;
			}
			current_stepper->step_number--;
		}
		// decrement the steps left:
		steps_left--;
		
		if (current_stepper->use_half_step)
		{
			// we have 8 steps, next step number will be 0, 1, 2, 3, 4, 5, 6 or 7:// JZ 20091104
			stepMotor(current_stepper, current_stepper->step_number % 8);	// JZ 20091104
		} else {
			// step the motor to step number 0, 1, 2, or 3:
			stepMotor(current_stepper, current_stepper->step_number % 4);
		}
		
		// create step delay
		TIM3_update_flag = 0;
		TIM_SetAutoreload(TIM3, current_stepper->stepper_speed);	//set period
		TIM_SetCounter(TIM3, 0);
		TIM_Cmd(TIM3, ENABLE);
		while(TIM3_update_flag != 1);
		TIM_Cmd(TIM3, DISABLE);
	}	
	if (current_stepper->maintain_position == MAINTAIN_POS){	//add aditional step delay, before pins are reseted
		TIM3_update_flag = 0;
		TIM_SetCounter(TIM3, 0);
		TIM_Cmd(TIM3, ENABLE);
		while(TIM3_update_flag != 1);
		TIM_Cmd(TIM3, DISABLE);
	}
	//reset motor pins
	GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
	GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
	if(current_stepper->pin_count == 4){
		GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
		GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
	}
	
}


/*
  * Moves the motor target position.  If the number is negative, the motor moves in the reverse direction.
	* blocking function - allow target change.
 */
void moveToTargetPos(stepper_struct* current_stepper)
{
	int32_t steps_to_move = current_stepper->target_step_number - current_stepper->current_step_number;
	
	while (steps_to_move != 0){
		if(steps_to_move >= 0){
			steps_to_move += current_stepper->correction_pulses;
		}
		else{
			steps_to_move -= current_stepper->correction_pulses;
		}

		if (steps_to_move > 0) // determine direction based on whether steps_to_move is + or -:
		{
			current_stepper->direction = DIRECTION_CW;
			current_stepper->current_step_number++;	// increment overall step number - from home position
			current_stepper->step_number++;					// increment motor current step number (1-number_of_steps)

			if( (current_stepper->step_number) == current_stepper->number_of_steps)	{
				current_stepper->step_number = 0;
			}
			if (current_stepper->use_half_step){
				stepMotor(current_stepper, current_stepper->step_number % 8);	// step the motor to step number 0, 1, 2, 3, 4, 5, 6 or 7
			} 
			else{
				stepMotor(current_stepper, current_stepper->step_number % 4); // step the motor to step number 0, 1, 2, or 3
			}
		}
		else{	//direction = DIRECTION_CCW
			current_stepper->direction = DIRECTION_CCW;
			current_stepper->current_step_number--;	// increment overall step number - from home position
				
			if (current_stepper->step_number == 0) {
				current_stepper->step_number = current_stepper->number_of_steps -1;
			}
			else{
				current_stepper->step_number--;	// increment motor current step number (1-number_of_steps)
			}
			
			if (current_stepper->use_half_step){
				stepMotor(current_stepper, current_stepper->step_number % 8);	// step the motor to step number 0, 1, 2, 3, 4, 5, 6 or 7
			} 
			else{
				stepMotor(current_stepper, current_stepper->step_number % 4); // step the motor to step number 0, 1, 2, or 3
			}
		}
	
		// create step delay
		TIM3_update_flag = 0;
		TIM_SetAutoreload(TIM3, current_stepper->stepper_speed);	//set period
		TIM_SetCounter(TIM3, 0);
		TIM_Cmd(TIM3, ENABLE);
		while(TIM3_update_flag != 1);
		TIM_Cmd(TIM3, DISABLE);
		
		// update steps to move(in the middle of this function some interrupt my change target position)
		steps_to_move = current_stepper->target_step_number - current_stepper->current_step_number;
	}	// end of while loop - step to target.
	
